# //Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd

data=[4,8,15,16,23,42]

series=pd.Series(data)

series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
import pandas as pd
l=[1,2,3,4,5,6,7,8,9,10]
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [11]:
import pandas as pd

data={
    'name':["Alice","Bob","Claire"],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}

df=pd.DataFrame(data)
print(df)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame:In Pandas, a DataFrame is a two-dimensional, size-mutable, and 
heterogeneous tabular data structure. It is essentially a table with rows and columns,
where each column can hold different data types

In [12]:
import pandas as pd

data={
    'Name':['swapnil','akash','yash'],
    'Age':[25,23,26]
}

df=pd.DataFrame(data)
print(df)

      Name  Age
0  swapnil   25
1    akash   23
2     yash   26

Series:, a Series is a one-dimensional labeled arraythat can hold data 
of any type. You can think of a Series as a single column from a DataFrame. 
It has a label (or index) for each element, and you can perform various 
operations on it,

In [13]:
import pandas as pd
ages=pd.Series([10,20,30],name="Age")
print(ages)

0    10
1    20
2    30
Name: Age, dtype: int64

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [19]:
import pandas as pd
data={
    'Name':['swapnil','akash','rohit','yash'],
    'Age':[12,36,25,85]
}
df=pd.DataFrame(data)

Viewing Data:
head(n): Returns the first n rows of the DataFrame.
tail(n): Returns the last n rows of the DataFrame.

In [20]:
df.head(3)

      Name  Age
0  swapnil   12
1    akash   36
2    rohit   25

In [21]:
df.tail()

      Name  Age
0  swapnil   12
1    akash   36
2    rohit   25
3     yash   85

Selecting Data:
loc[]: Allows you to select data by label (row and column names).
iloc[]: Allows you to select data by integer positions.

In [22]:
df.loc[2,['Name']]

Name    rohit
Name: 2, dtype: object

In [23]:
df.iloc[2,[0,1]]

Name    rohit
Age        25
Name: 2, dtype: object

Filtering Data:
df[df['column'] > value]: Filters rows based on a condition.

In [25]:
df[df['Age']>30]

    Name  Age
1  akash   36
3   yash   85

describe():
gives the statical analysis of the data

In [27]:
df.describe()

             Age
count   4.000000
mean   39.500000
std    31.879983
min    12.000000
25%    21.750000
50%    30.500000
75%    48.250000
max    85.000000

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series: You can change the values of a Series after it is created by assigning new values to specific elements 
using their labels or positions.

DataFrame: You can modify the content of a DataFrame by adding, updating, or deleting rows and columns.

Panel:Pannel is not mutable it is used to handel MultiIndex data frame

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [30]:
import pandas as pd
name=pd.Series(['abc','bcd','def'])
age=pd.Series([10,20,15])
cities=pd.Series(['fff','ggg','iii'])

data={
    'Nmae':name,
    'age':age,
    'city':cities
}
df=pd.DataFrame(data)
print(df)

  Nmae  age city
0  abc   10  fff
1  bcd   20  ggg
2  def   15  iii